read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog ha.v array2.v array4.v array8.v array16.v
synth -top array16
#dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
flatten
write_verilog -noattr synth.v
tee -o report_array.txt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
